app/controllers/admin/categories_controller.rb

  def destroy
    @record = Category.find(params[:id])
    return(render 'admin/shared/destroy') unless request.post?

    @record.destroy
---
SELECT "categories".* FROM "categories" WHERE ("categories".parent_id = 3) ORDER BY name ASC, name
DELETE FROM "categories" WHERE "categories"."id" = 3